tap "dbcli/tap"
tap "homebrew/bundle"
tap "warrensbox/tap"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "ast-grep"
brew "python@3.11"
brew "aws-elasticbeanstalk"
brew "awscli", link: false
brew "boost"
brew "bottom"
brew "python@3.12"
brew "glib"
brew "docker", link: false
brew "duckdb"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "openblas"
brew "openvino"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "tcl-tk"
brew "git-gui"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "openjdk"
brew "gradle"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "helm"
brew "inetutils"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libpq"
brew "lnav"
brew "lua-language-server"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "openjdk@11"
brew "openssl@1.1"
brew "pgcli"
brew "pipx"
brew "pngpaste"
brew "postgresql@14"
brew "postgresql@15"
brew "python@3.10"
brew "python@3.9"
brew "redis"
brew "ripgrep"
brew "scrcpy"
brew "socat"
brew "stow"
brew "tmux"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "xmlto"
brew "zellij"
brew "zlib"
brew "zoxide"
brew "warrensbox/tap/tfswitch"
cask "emacs"
cask "finch"
cask "iterm2"
cask "ngrok"
cask "vagrant"
vscode "4ops.terraform"
vscode "adamhartford.vscode-base64"
vscode "adpyke.vscode-sql-formatter"
vscode "aidencuneo.quokkasyntax"
vscode "alefragnani.rtf"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.tsl-problem-matcher"
vscode "apollographql.vscode-apollo"
vscode "asciidoctor.asciidoctor-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "aswinkumar863.smarty-template-support"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bengreenier.vscode-node-readme"
vscode "berublan.vscode-log-viewer"
vscode "catppuccin.catppuccin-vsc"
vscode "chaunceykiwi.json-tree-view"
vscode "chrisjaustin.postgres-plan"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "cmstead.js-codeformer"
vscode "cmstead.jsrefactor"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "erd0s.terraform-autocomplete"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.github-actions"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "jatz.peoplesoft-tools"
vscode "kavod-io.vscode-jest-test-adapter"
vscode "kelvin.vscode-sshfs"
vscode "kisstkondoros.vscode-codemetrics"
vscode "lian1925.webpack-config"
vscode "mathiasfrohlich.kotlin"
vscode "mcastany.saml-extension"
vscode "mechatroner.rainbow-csv"
vscode "mikeburgh.xml-format"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mrmlnc.vscode-less"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.remote-wsl-recommender"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "mtxr.sqltools"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "oracle.oracledevtools"
vscode "orta.vscode-jest"
vscode "postman.postman-for-vscode"
vscode "radwanfaci.stack-trace-formatter"
vscode "rajratnamaitry.open-folder-in-new-vscode"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "renkun.reader"
vscode "robole.markdown-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "samuelcolvin.jinjahtml"
vscode "sburg.vscode-javascript-booster"
vscode "secanis.jenkinsfile-support"
vscode "septh.wow-bundle"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stevencl.adddoccomments"
vscode "streetsidesoftware.code-spell-checker"
vscode "thomascsd.vscode-readme-pattern"
vscode "tht13.html-preview-vscode"
vscode "tommasov.hosts"
vscode "tomoki1207.pdf"
vscode "tomsaunders-code.workspace-explorer"
vscode "tyriar.sort-lines"
vscode "unclebeast.har-viewer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yokawasa.jwt-debugger"
